# Harvard CS109b, Spring 2018 Lecture 21

# Installation and Setup

### Install MySQL

1. Download free MySQL Community Edition [https://dev.mysql.com/downloads/](https://dev.mysql.com/downloads/)
2. Start MySQL. On Mac, use System Preferences, MySQL
3. Install Jupyter connector [http://bigdatazone.blogspot.com/2017/05/run-sql-from-within-jupyter-notebook.html](http://bigdatazone.blogspot.com/2017/05/run-sql-from-within-jupyter-notebook.html)

The iPython - SQL connector: [https://github.com/catherinedevlin/ipython-sql](https://github.com/catherinedevlin/ipython-sql)

In [2]:
# Load the Jupyter Extension
%load_ext sql

In [3]:
try:
    import pymysql
    pymysql.install_as_MySQLdb()
except ImportError:
    pass

In [4]:
# Connect to the database
# TODO: substitute your MySQL password here
%sql mysql://root:0=^b-jLRm)2W\<QPIW#J@localhost

/anaconda/lib/python3.6/site-packages/pymysql/cursors.py:165: Warning: (1287, "'@@tx_isolation' is deprecated and will be removed in a future release. Please use '@@transaction_isolation' instead")
  result = self._query(query)

'Connected: root@None'

# Create a database

In [5]:
# Create the database
%sql create database school

 * mysql://root:***@localhost
1 rows affected.

[]

In [6]:
# Connect to the new database
# TODO: enter your password here
%sql mysql://root:0=^b-jLRm)2W\<QPIW#J@localhost/school

/anaconda/lib/python3.6/site-packages/pymysql/cursors.py:165: Warning: (1287, "'@@tx_isolation' is deprecated and will be removed in a future release. Please use '@@transaction_isolation' instead")
  result = self._query(query)

'Connected: root@school'

In [7]:
%sql CREATE TABLE student(ID int NOT NULL,name varchar(50),email varchar(50));

   mysql://root:***@localhost
 * mysql://root:***@localhost/school
0 rows affected.

[]

In [8]:
%sql ALTER TABLE student ADD PRIMARY KEY (ID);

   mysql://root:***@localhost
 * mysql://root:***@localhost/school
0 rows affected.

[]

In [9]:
%sql DESC student

   mysql://root:***@localhost
 * mysql://root:***@localhost/school
3 rows affected.

[('ID', 'int(11)', 'NO', 'PRI', None, ''),
 ('name', 'varchar(50)', 'YES', '', None, ''),
 ('email', 'varchar(50)', 'YES', '', None, '')]

In [10]:
%sql INSERT into student values(12345678, "Test User", "testuser@g.harvard.edu")

   mysql://root:***@localhost
 * mysql://root:***@localhost/school
1 rows affected.

[]

In [11]:
%sql INSERT into student values(23456789, "Jane Doe", "janed@g.harvard.edu")

   mysql://root:***@localhost
 * mysql://root:***@localhost/school
1 rows affected.

[]

In [12]:
%sql select * from student

   mysql://root:***@localhost
 * mysql://root:***@localhost/school
2 rows affected.

[(12345678, 'Test User', 'testuser@g.harvard.edu'),
 (23456789, 'Jane Doe', 'janed@g.harvard.edu')]

In [13]:
%sql CREATE TABLE classroom(ID int NOT NULL, name varchar(50), location varchar(20));

   mysql://root:***@localhost
 * mysql://root:***@localhost/school
0 rows affected.

[]

In [14]:
%sql insert into classroom values (123,"CS109B", "NWB103");

   mysql://root:***@localhost
 * mysql://root:***@localhost/school
1 rows affected.

[]

In [15]:
%sql insert into classroom values (234, "AM207", "MDG125")

   mysql://root:***@localhost
 * mysql://root:***@localhost/school
1 rows affected.

[]

In [16]:
%sql select * from classroom

   mysql://root:***@localhost
 * mysql://root:***@localhost/school
2 rows affected.

[(123, 'CS109B', 'NWB103'), (234, 'AM207', 'MDG125')]

In [17]:
%%sql 
create table registration( 
                               student_id int NOT NULL, 
                               class_id int NOT NULL, 
                               FOREIGN KEY (student_id) REFERENCES student(ID));

   mysql://root:***@localhost
 * mysql://root:***@localhost/school
0 rows affected.

[]

In [18]:
%sql desc registration

   mysql://root:***@localhost
 * mysql://root:***@localhost/school
2 rows affected.

[('student_id', 'int(11)', 'NO', 'MUL', None, ''),
 ('class_id', 'int(11)', 'NO', '', None, '')]

In [19]:
%sql insert into registration values (12345678, 123)

   mysql://root:***@localhost
 * mysql://root:***@localhost/school
1 rows affected.

[]

In [20]:
%sql select * from registration;

   mysql://root:***@localhost
 * mysql://root:***@localhost/school
1 rows affected.

[(12345678, 123)]

In [21]:
%%sql 
select s.name "Student", c.name "Course" 
from student s, registration r, classroom c 
where c.id = r.class_id and s.id = r.student_id

   mysql://root:***@localhost
 * mysql://root:***@localhost/school
1 rows affected.

[('Test User', 'CS109B')]

In [22]:
%%sql 
SELECT s.name as Student, c.name as Course
FROM student s 
    INNER JOIN registration r ON s.id = r.student_id 
    INNER JOIN classroom c ON r.class_id  = c.id 
ORDER BY s.name

   mysql://root:***@localhost
 * mysql://root:***@localhost/school
1 rows affected.

[('Test User', 'CS109B')]

# Use Database in Python 

## MySQL Library

In [23]:
import mysql.connector
# TODO: substitute your MySQL password here
cnx = mysql.connector.connect(user='root',password='0=^b-jLRm)2W\<QPIW#J', host='localhost',database='school')

In [24]:
query = ("SELECT s.name as Student, c.name as Course FROM student s " +
            "INNER JOIN registration r ON s.id = r.student_id " + 
            "INNER JOIN classroom c ON r.class_id  = c.id "+ 
            "ORDER BY s.name")
query

'SELECT s.name as Student, c.name as Course FROM student s INNER JOIN registration r ON s.id = r.student_id INNER JOIN classroom c ON r.class_id  = c.id ORDER BY s.name'

In [25]:
cursor = cnx.cursor()
cursor.execute((query))

In [26]:
for (name, course) in cursor:
    print (name, course)

Test User CS109B

## From Pandas

In [27]:
import pandas as pd
df = pd.read_sql(query, con=cnx)
len(df)

1

In [28]:
enrollment = df.sort_values(['Student','Course']).groupby('Student')
enrollment.head(5)

     Student  Course
0  Test User  CS109B

# To Reset Everything

In [ ]:
# Note that dropping the database may hang because of the Pandas and MySQL Library connections.
# You may need to restart your Jupyter kernel for this to have effect.
%sql drop database school

In [ ]:
%sql show databases;

In [ ]:
%sql create database school